In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    'name':['harry','rohan','skillf','shubh'],
    'marks':[92,34,24,67],
    'city':['rampur','kolkata','bareli','antarctica']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24      bareli
3   shubh     67  antarctica

In [12]:
df.to_csv('friends.csv')

In [10]:
df.to_csv('friends_index_false.csv', index=False)

In [13]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [14]:
df.tail(2)

     name  marks        city
2  skillf     24      bareli
3   shubh     67  antarctica

In [15]:
df.describe()

           marks
count   4.000000
mean   54.250000
std    31.159536
min    24.000000
25%    31.500000
50%    50.500000
75%    73.250000
max    92.000000

In [18]:
gaurav = pd.read_csv('gaurav.csv',usecols = ['Train No','Speed','city']);

In [19]:
gaurav

   Train No  Speed        city
0    234234     45      rampur
1     42442     34     kolkata
2     34234      4      bareli
3    234234    345  antarctica

In [22]:
gaurav['Speed'][0] = 50

<ipython-input-22-886ff29410e1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gaurav['Speed'][0] = 50

In [23]:
gaurav['Speed'][0] = 50

<ipython-input-23-886ff29410e1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gaurav['Speed'][0] = 50

In [24]:
gaurav['Speed']

0     50
1     34
2      4
3    345
Name: Speed, dtype: int64

In [25]:
gaurav.to_csv('gaurav.csv')